tsung-session.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="info" dumptraffic="false" version="1.0">

  <clients>
    <client host="localhost" use_controller_vm="true"/>
  </clients>

  <servers>
    <server host="192.168.1.1" port="80" type="tcp"></server>
  </servers>

  <load loop="2">
    <arrivalphase phase="1" duration="10" unit="minute">
      <users maxnumber="1000" interarrival="5" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <option name="file_server" id='userdb' value="/home/ubuntu/tsung-data.csv"/>
  </options>

  <sessions>
    <session name="foo" probability="100" type="ts_http">
      <setdynvars sourcetype="file" fileid="userdb" delimiter=";" order="iter">
        <var name="message" />
      </setdynvars>
      <for from="1" to="100" var="post_number">
        <request subst="true"><http url="http://10.248.44.154/" method="POST" contents="loaduser%%_tsung_userid%%: %%_message%%"></http></request>
        <thinktime min="15" max="30" random="true"></thinktime>
      </for>
    </session>
  </sessions>
</tsung>